//使用ai要具有问题解决能力
//web:能够通过浏览器访问的网站
//前端程序:界面展示
//后端程序:处理业务逻辑
//数据库:存储数据和管理数据


//web前端开发
//网页:文字,图片,视频,音频,超链接
//前端代码要经过浏览器解析渲染,才能显示出网页
//web标准:HTML,CSS,JavaScript
//HTML:负责网页的结构(页面元素和内容)
//CSS:负责网页的样式(布局,位置,颜色,字体等)
//JavaScript:负责网页的交互(响应用户操作,动态更新内容等)

//vue:一个前端框架,用于构建单页应用(SPA)
//Ajax:异步JavaScript和XML,用于在不刷新整个页面的情况下,与服务器进行数据交互

//HTML(结构)+CSS(样式)
//HTML:
//超文本:可以包含文字,图片,视频,音频,超链接等
//标记语言:由标签"<标签名>"构成的语言 <h1>展示标题,<img>展示图片,<video>展示视频等
//<h1>web入门</h1>   <img src="图片路径" alt="图片描述"> <img里面的就是标签的属性
//HTML标签由浏览器解析

//CSS:
//层叠样式表:用于描述网页的样式(布局,位置,颜色,字体等)
//由标签"<标签名>属性:值;"构成的语言
//例如:<h1 属性:值></h1>; <h1 style="color:red;">web入门</h1>
//mdn web docs:https://developer.mozilla.org/zh-CN/docs/Web/CSS HTML文档


//HTML入门:
//文本文件后缀名改为html
//head:网页头部信息用来存放给浏览器看的信息,如:CSS样式,字符编码,标题 <title>HTML快速入门</title>
//body:网页主体内容用来存放给用户看到的内容,如:文字,图片,视频等
//<h1>hello html</h1> <img src="图片路径" alt="图片描述"> h1是一级标题

//语法特点:标签不区分大小写的,语法结构不严谨
